{
  "backend/main.mo": "Motoko canister managing inquiry records with submission, lookup, and listing functions.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Base HTML file setting up the root element and loading the React entry script.",
  "frontend/src/App.tsx": "Root React component rendering the MarketingPage.",
  "frontend/src/components/SiteFooter.tsx": "Footer with navigation links, branding, and contact details.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with navigation, branding, and mobile menu.",
  "frontend/src/features/marketing/content/contact.ts": "Exports shared contact details for phone, email, and location.",
  "frontend/src/features/marketing/forms/InquiryForm.tsx": "Form component handling inquiry input, validation, submission, and success/error states.",
  "frontend/src/features/marketing/forms/inquiryValidation.ts": "Defines inquiry form data types and validates fields like name, email, message, and consent, returning errors if invalid.",
  "frontend/src/features/marketing/hooks/useSubmitInquiry.ts": "Hook that submits inquiry data through the backend actor, handling phone parsing and loading/error states.",
  "frontend/src/features/marketing/MarketingPage.tsx": "Page layout composing hero, services, about, contact sections plus header and footer.",
  "frontend/src/features/marketing/sections/AboutSection.tsx": "Renders an About section highlighting agency values with descriptive cards and text content.",
  "frontend/src/features/marketing/sections/ContactSection.tsx": "Displays contact details and renders the inquiry form within a styled contact section.",
  "frontend/src/features/marketing/sections/HeroSection.tsx": "Hero banner with headline, CTAs, smooth-scroll behavior, and a featured image.",
  "frontend/src/features/marketing/sections/ServicesSection.tsx": "Presents a grid of service cards describing the agency’s marketing offerings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity context, login handling, and AuthClient setup for Internet Identity integration.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "TailwindCSS config enabling dark mode, custom OKLCH color system, extended theme settings, and typography/container-query/animation plugins.",
  "project_state.json": "Project state metadata describing the HS Media Agency website requirements, existing features, and pending feature requests."
}